backend/app/graphql/mutations/create_habit.rb

    def resolve(name:, description: nil, emoji: '⚡', color: '#a855f7', streak_goal: 'none')
      habit = Habit.new(
        name: name,
        description: description,
        emoji: emoji,
        color: color,
        streak_goal: streak_goal
      )

      if habit.save
---
INSERT INTO "habits" ("external_id", "name", "description", "emoji", "color", "streak_goal", "completions", "current_streak", "longest_streak", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"