backend/app/graphql/mutations/toggle_habit_completion.rb

    def resolve(external_id:, date: nil)
      habit = Habit.find_by(external_id: external_id)
---
SELECT "habits".* FROM "habits" WHERE "habits"."external_id" = $1 LIMIT $2  [["external_id", "sample-habit-1"], ["LIMIT", 1]]