backend/app/graphql/types/query_type.rb

SELECT "habits".* FROM "habits" WHERE "habits"."external_id" = $1 LIMIT $2  [["external_id", "09ba4616-cdc2-4a20-83c2-01a56a700a4c"], ["LIMIT", 1]]
---
    def habit_month_data(external_id:, year:, month:)
      habit = Habit.find_by!(external_id: external_id)